/*********************************************************************************************
* 文件：stadiometry.c
* 作者：Lixm 2017.10.17
* 说明：红外测距驱动代码
* 修改：
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "stadiometry.h"
#include "delay.h"
#include <math.h>
/*********************************************************************************************
* 名称：stadiometry_init()
* 功能：红外测距传感器初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void stadiometry_init(void)
{
  APCFG |= 0x10;                                                //模拟 I/O 使能  
  P0SEL |= 0x10;                                                //端口0_4 功能选择外设功能
  P0DIR &= ~0x10;                                               //设置输入模式
  ADCCON3  = 0xB4;                                              //选择AVDD5为参考电压；12分辨率；P0_4  ADC  
  ADCCON1 |= 0x30;                                              //选择ADC的启动模式为手动
}

/*********************************************************************************************
* 名称：float get_stadiometry_data(void)
* 功能：获取红外测距传感器状态
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
float get_stadiometry_data(void)
{ 
  unsigned int  value = 0;
  ADCCON3  = 0xB4;                                              //选择AVDD5为参考电压；12分辨率；P0_4  ADC    
  ADCCON1 |= 0x30;                                              //选择ADC的启动模式为手动
  ADCCON1 |= 0x40;                                              //启动AD转化             
  
  while(!(ADCCON1 & 0x80));                                     //等待ADC转化结束  
  value =  ADCL >> 4;   
  delay_ms(1);
  value |= (ADCH << 8)>> 4;                                     //取得最终转化结果，存入value中  
  //A6：红外测距；根据传感器手册的曲线图，拟合出的公式为：dis=27.092*(vol^-1.273)
  double vol = value / 2048.0 * 3.3;    //12位分辨率，最高位为符号位，所以除以2048
  return (float)(27.092 * pow(vol, -1.273));
}