/*********************************************************************************************
* 文件：zxbee.c
* 作者：Xuzhy 2018.5.16
* 说明：ZXBee通信协议数据包解包
* 修改：fuyou 增加透传驱动
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include "hal_types.h"
#include "zxbee.h"
/*********************************************************************************************
* 宏定义
*********************************************************************************************/

/*********************************************************************************************
* 全局变量
*********************************************************************************************/
static char wbuf[96];
/*********************************************************************************************
* 函数原型说明
*********************************************************************************************/
int ZXBeeSysCommandProc(char *ptag, char *pval);
int ZXBeeUserProcess(char *ptag, char *pval);
/*********************************************************************************************
* 名称：ZXBeeBegin()
* 功能：ZXBee通信协议的帧头“{”
* 参数：
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
int8 ZXBeeBegin(void)
{
  wbuf[0] = '{';
  wbuf[1] = '\0';
  return 1;
}
/*********************************************************************************************
* 名称：ZXBeeAdd()
* 功能：ZXBee通信协议的数据包中添加数据
* 参数：tag -- 变量；val -- 值
* 返回：len -- 数据长度
* 修改：
* 注释：
*********************************************************************************************/
int8 ZXBeeAdd(char* tag, char* val)
{
  sprintf(&wbuf[strlen(wbuf)], "%s=%s,", tag, val);
  return strlen(wbuf);
}
/*********************************************************************************************
* 名称：ZXBeeEnd()
* 功能：ZXBee通信协议的数据包添加结束帧“}”,并返回封包后的数据包指针
* 参数：wbuf -- 返回封包后的数据包指针
* 返回：
* 修改：
* 注释：
*********************************************************************************************/
char* ZXBeeEnd(void)
{
  int offset = strlen(wbuf);
  wbuf[offset-1] = '}';
  wbuf[offset] = '\0';
  if (offset > 2) return wbuf;
  return NULL;
}
/*********************************************************************************************
* 名称：ZXBeeDecodePackage()
* 功能：对接收到的无线数据包进行解包
* 参数：pkg -- 数据   len -- 数据长度
* 返回：p -- 返回的数据包
* 修改：
* 注释：
*********************************************************************************************/
char* ZXBeeDecodePackage(char *pkg, int len)
{
  char *p;
  char *ptag = NULL;
  char *pval = NULL;

  if (pkg[0] != '{' || pkg[len-1] != '}') return NULL;
  
  ZXBeeBegin();

  pkg[len-1] = 0;
  p = pkg+1;
  do {
    ptag = p;
    p = strchr(p, '=');
    if (p != NULL) {
      *p++ = 0;
      pval = p;
      p = strchr(p, ',');
      if (p != NULL) *p++ = 0;
      int ret;
      ret = ZXBeeSysCommandProc(ptag, pval);
      if (ret < 0) {
#ifndef CC2530_Serial
                ret = ZXBeeUserProcess(ptag, pval);
#endif
      }
    }
  } while (p != NULL);
  p = ZXBeeEnd();

  return p;
}