/*********************************************************************************************
* 文件：led.c
* 作者：Meixin 2017.09.15
* 说明：LED灯驱动代码     
* 修改：liutong 20171027 修改了LED控制引脚初始化函数名称、优化了注释、增加了LED打开和关闭函数
* 注释：
*********************************************************************************************/

/*********************************************************************************************
* 头文件
*********************************************************************************************/
#include "led.h"

/*********************************************************************************************
* 名称：led_init()
* 功能：LED控制引脚初始化
* 参数：无
* 返回：无
* 修改：
* 注释：
*********************************************************************************************/
void led_init(void)
{
  P0SEL &= ~0x30;                                               //配置控制管脚（p0.4, p0.5）为通用IO模式
  P0DIR |= 0x30;                                                //配置控制管脚（p0.4, p0.5）为输出模式
  
  LED1 = OFF;                                                     //初始状态为关闭
  LED2 = OFF;                                                     //初始状态为关闭
}
  
/*********************************************************************************************
* 名称：led_on()
* 功能：LED控制打开函数
* 参数：LED号，在led.h中宏定义为LED1，LED2
* 返回：0，打开LED成功，-1，参数错误
* 修改：
* 注释：参数只能填入LED1，LED2,否则会返回-1
*********************************************************************************************/
signed char led_on(unsigned char led)
{
  if(led == LED1){                                                //如果要打开LED1
    LED1 = ON;
    return 0;
  }
    
  if(led == LED2){                                                //如果要打开LED2
    LED2 = ON;
    return 0;
  }
  
  return -1;                                                    //参数错误，返回-1
}

/*********************************************************************************************
* 名称：led_off()
* 功能：LED控制关闭函数
* 参数：LED号，在led.h中宏定义为LED1，LED2
* 返回：0，关闭LED成功，-1，参数错误
* 修改：
* 注释：参数只能填入LED1，LED2,否则会返回-1
*********************************************************************************************/
signed char led_off(unsigned char led)
{
  if(led == LED1){                                                //如果要关闭LED1
    LED1 = OFF;
    return 0;
  }
    
  if(led == LED2){                                                //如果要关闭LED2
    LED2 = OFF;
    return 0;
  }
  
  return -1;                                                    //参数错误，返回-1
}